# korean symbols
PHONEMES = [
    '_', 'aa', 'c0', 'cc', 'ch', 'ee', 'h0', 'ii', 'k0', 'kf', 'kh', 'kk', 'll', 'mf', 'mm', 'nf',
    'ng', 'nn', 'oo', 'p0', 'pf', 'ph', 'pp', 'qq', 'rr', 's0', 'ss', 't0', 'tf', 'th', 'tt',
    'uu', 'vv', 'wa', 'we', 'wi', 'wo', 'wq', 'wv', 'xi', 'xx', 'ya', 'ye', 'yo', 'yq', 'yu', 'yv'
]


GRAPHEMES = [
    '_', ' ', 'ᄀ', 'ᄁ', 'ᄂ', 'ᄃ', 'ᄄ', 'ᄅ', 'ᄆ', 'ᄇ', 'ᄈ', 'ᄉ',
    'ᄊ', 'ᄋ', 'ᄌ', 'ᄍ', 'ᄎ', 'ᄏ', 'ᄐ', 'ᄑ', 'ᄒ', 'ᅡ',
    'ᅢ', 'ᅣ', 'ᅤ', 'ᅥ', 'ᅦ', 'ᅧ', 'ᅨ', 'ᅩ', 'ᅪ', 'ᅫ',
    'ᅬ', 'ᅭ', 'ᅮ', 'ᅯ', 'ᅰ', 'ᅱ', 'ᅲ', 'ᅳ', 'ᅴ', 'ᅵ',
    'ᆨ', 'ᆩ', 'ᆫ', 'ᆭ', 'ᆮ', 'ᆯ', 'ᆰ', 'ᆲ', 'ᆶ', 'ᆷ',
    'ᆸ', 'ᆹ', 'ᆺ', 'ᆻ', 'ᆼ', 'ᆽ', 'ᆾ', 'ᇀ', 'ᇁ', 'ᇂ', '#'
]  # for ctc, _ for padding
VOC_SIZE = len(GRAPHEMES)
